app/views/timeline/populate.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        <td><%= article.text %></td>
        <td><%= User.find(article.user_id).name %></td>