app/controllers/follow_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_user_id", 2], ["created_at", "2022-05-25 11:02:51.080468"], ["updated_at", "2022-05-25 11:02:51.080468"]]
---
    def create
        @user = User.find(params[:follower_id])
        followed_user_id = params[:followed_user_id]
        @follow = Follow.create(follower_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
    def show
        @user = User.find(current_user.id)