app/controllers/timeline_controller.rb

    def populate

        @followers = User.find(current_user.id).followings
        @timeline_articles = []
        Article.find_each do |article|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" ASC LIMIT 1000

    def feeds
        @user_articles = User.find(params[:user]).articles
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]