app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaa"], ["email", "a@b.com"], ["password", "123456"], ["created_at", "2022-05-25 08:49:00.731902"], ["updated_at", "2022-05-25 08:49:00.731902"]]
---
    def create
        @user = User.new(users_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def index
        all_users = User.all
        all_users = all_users.filter{ |user| user.id != current_user.id }
        all_users_map = all_users.map { |item| item[:id] }

        followers = current_user.followings
        follower_map = followers.map { |item| item[:id] }
        new_map =  all_users_map - follower_map

        @users = new_map.map{ |item| User.find(item) }